Revit 2027 API
ParameterTypeId.WallSweepWallSubcategoryId Property
 "Subcategory of Walls"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId WallSweepWallSubcategoryId { get; }
Public Shared ReadOnly Property WallSweepWallSubcategoryId As ForgeTypeId
	Get
public:
static property ForgeTypeId^ WallSweepWallSubcategoryId {
	ForgeTypeId^ get ();
}
static member WallSweepWallSubcategoryId : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace